In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("dataexport_20210427T161721.csv")

In [3]:
df.shape

(201, 5)

In [4]:
row,colmn=df.shape

In [5]:
row

201

In [6]:
colmn

5

In [7]:
df.head(3)

  location     Basel   Basel.1   Basel.2   Basel.3
0      lat  47.54694  47.54694  47.54694  47.54694
1      lon   7.56892   7.56892   7.56892   7.56892
2      asl   283.697   283.697   283.697   283.697

In [8]:
df.tail(4)

          location       Basel Basel.1    Basel.2    Basel.3
197  20210427T2000   17.250528    40.0   9.028754  336.50146
198  20210427T2100  15.8005295    45.0  7.7879906  326.30994
199  20210427T2200   14.520529    47.0   5.495161  328.39252
200  20210427T2300   13.200529    51.0  1.9386592   338.1986

In [9]:
df[0:4]

   location        Basel            Basel.1     Basel.2         Basel.3
0       lat     47.54694           47.54694    47.54694        47.54694
1       lon      7.56892            7.56892     7.56892         7.56892
2       asl      283.697            283.697     283.697         283.697
3  variable  Temperature  Relative Humidity  Wind Speed  Wind Direction

In [10]:
df.columns

Index(['location', 'Basel', 'Basel.1', 'Basel.2', 'Basel.3'], dtype='object')

In [11]:
df.Basel

0         47.54694
1          7.56892
2          283.697
3      Temperature
4               Â°C
          ...
196       18.13053
197      17.250528
198     15.8005295
199      14.520529
200      13.200529
Name: Basel, Length: 201, dtype: object

In [12]:
min(df.Basel)

'10.090529'

In [13]:
print(type(df.Basel))

<class 'pandas.core.series.Series'>

In [14]:
df[["Basel","Basel.2" ]]

           Basel     Basel.2
0       47.54694    47.54694
1        7.56892     7.56892
2        283.697     283.697
3    Temperature  Wind Speed
4             Â°C        km/h
..           ...         ...
196     18.13053   11.177405
197    17.250528    9.028754
198   15.8005295   7.7879906
199    14.520529    5.495161
200    13.200529   1.9386592

[201 rows x 2 columns]

In [15]:
df.Basel.max()

'Â°C'

In [16]:
df.Basel.max()

'Â°C'

In [17]:
df.Basel.describe()

count           201
unique          187
top       6.3505287
freq              4
Name: Basel, dtype: object

In [18]:
df[df.Basel==df.Basel.max()]

  location Basel Basel.1 Basel.2 Basel.3
4     unit    Â°C       %    km/h       Â°

In [19]:
# df.Basel.sum()

In [20]:
df.index

RangeIndex(start=0, stop=201, step=1)

In [21]:
df.set_index("location",inplace=True)

In [22]:
df.loc["20210427T1900"]

Basel       18.13053
Basel.1         38.0
Basel.2    11.177405
Basel.3     345.0686
Name: 20210427T1900, dtype: object

In [23]:
df

                     Basel            Basel.1     Basel.2         Basel.3
location
lat               47.54694           47.54694    47.54694        47.54694
lon                7.56892            7.56892     7.56892         7.56892
asl                283.697            283.697     283.697         283.697
variable       Temperature  Relative Humidity  Wind Speed  Wind Direction
unit                    Â°C                  %        km/h               Â°
...                    ...                ...         ...             ...
20210427T1900     18.13053               38.0   11.177405        345.0686
20210427T2000    17.250528               40.0    9.028754       336.50146
20210427T2100   15.8005295               45.0   7.7879906       326.30994
20210427T2200    14.520529               47.0    5.495161       328.39252
20210427T2300    13.200529               51.0   1.9386592        338.1986

[201 rows x 4 columns]

In [24]:
df.reset_index(inplace=True)

In [25]:
df

          location        Basel            Basel.1     Basel.2         Basel.3
0              lat     47.54694           47.54694    47.54694        47.54694
1              lon      7.56892            7.56892     7.56892         7.56892
2              asl      283.697            283.697     283.697         283.697
3         variable  Temperature  Relative Humidity  Wind Speed  Wind Direction
4             unit           Â°C                  %        km/h               Â°
..             ...          ...                ...         ...             ...
196  20210427T1900     18.13053               38.0   11.177405        345.0686
197  20210427T2000    17.250528               40.0    9.028754       336.50146
198  20210427T2100   15.8005295               45.0   7.7879906       326.30994
199  20210427T2200    14.520529               47.0    5.495161       328.39252
200  20210427T2300    13.200529               51.0   1.9386592        338.1986

[201 rows x 5 columns]